//**************************************************************************************************
//                         Copyright (C) 2009 RCZI
//--------------------------------------------------------------------------------------------------
// FILENAME....... drv_kbd_4x6.h
// DATE CREATED... 03/11/2009
// LAST MODIFIED.. 09/11/2009
//--------------------------------------------------------------------------------------------------
//             4 x 6    K E Y S    K E Y B O A R D    D R I V E R
//--------------------------------------------------------------------------------------------------
// !: arch: tms320c64xx
// !: sarc: all
//
// !: codepage: cp1251 
//
// !: d: ќписание внутренних управл€ющих команд драйвера клавиатуры (24 клавиши) 
// !: -:
//***sss********************************************************************************************
#ifndef     __Driver_KBD_4x6_U32_H__
#define     __Driver_KBD_4x6_U32_H__
#include    <os_types.h>

// -- For system calls only ---------------------------------------------------
extern int32     drv_kbd_4x6_plug(uint32 number_gpio_interrupt);
extern int32     drv_kbd_4x6_unplug();

#endif //__Driver_KBD_4x6_U32_H__


