// -- DO NOT REMOVE ----------------------------------------------------------
// !: arch: all
// !: sarc: all
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// !: codepage: cp866
// !: d: Модуль содержит прототипы функций для работы с кэшем процессора.
// !: -:
// ---------------------------------------------------------------------------
#ifndef __OS_Cache_H__
#define __OS_Cache_H__

#include <os_types.h>

extern void os_cache_writeback_invalidate( uint32 address, uint32 length );

#endif
// ---------------------------------------------------------------------------
