// -- DO NOT REMOVE ----------------------------------------------------------
// !: arch: all
// !: sarc: all
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// !: codepage: cp866
// !: d: Модуль содержит реализацию функции ушпешного завершения проверки спарки.
// !: -:
// ---------------------------------------------------------------------------
#include <mapi.h>
// ---------------------------------------------------------------------------

/**************************************************************************************************
Syntax:      	    int32 mapi_sptestok( uint32 d, uint32 p )
Remarks:			Функция отправки системного сообщения процессу ядра подтверждения на запрос готовности к тесту
Returns:
***************************************************************************************************/
int32 mapi_sptestok( uint32 d, uint32 p )
{
  s_mapi_sptestok m;
  m.cmd = MAPI_SPTESTOK;
  m.part = p;
  return msg_send( d, &m, sizeof(m) );
}
// ---------------------------------------------------------------------------
