// -- DO NOT REMOVE ----------------------------------------------------------
// !: arch: all
// !: sarc: all
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// !: codepage: cp866
// !: Модуль содержит реализацию функцию Оповещения Предстоящей проверки спарки.
// !: -:
// ---------------------------------------------------------------------------
#include <mapi.h>
// ---------------------------------------------------------------------------

/**************************************************************************************************
Syntax:      	    int32 mapi_sensortest( uint32 d, uint16 state, uint16 flags )
Remarks:			Функция отправки системного сообщения процессу ядра для запуска теста датчиков вскрытия изделия
Returns:
***************************************************************************************************/
int32 mapi_sensortest( uint32 d, uint16 state, uint16 flags )
{
  s_mapi_sensortest m;
  m.cmd = MAPI_SENSOR_TEST;
  m.state = state;
  m.flags = flags;
  return msg_send( d, &m, sizeof(m) );   //Отправляем Сообщение MAPI   (через msg_send)
}
// ---------------------------------------------------------------------------
