// -- DO NOT REMOVE ----------------------------------------------------------
// !: arch: all
// !: sarc: all
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// !: codepage: cp866
// !: d: Модуль содержит реализацию функции подтверждения режима проверки спарки.
// !: -:
// ---------------------------------------------------------------------------
#include <mapi.h>
// ---------------------------------------------------------------------------
/**************************************************************************************************
Syntax:      	    int32 mapi_sptestack( uint32 d )
Remarks:			Функция отправки системного сообщения процессу ядра запроса готовности на тест спарки
Returns:
***************************************************************************************************/

int32 mapi_sptestack( uint32 d )
{
  s_mapi_sptestack m;
  m.cmd = MAPI_SPTESTACK;
  return msg_send( d, &m, sizeof(m) );
}
// ---------------------------------------------------------------------------
