// -- DO NOT REMOVE ----------------------------------------------------------
// !: arch: all
// !: sarc: all
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// !: codepage: cp866
// !: d: Модуль содержит реализацию функции завершения работы по развалу спарки.
// !: -:
// ---------------------------------------------------------------------------
#include <mapi.h>
// ---------------------------------------------------------------------------

/**************************************************************************************************
Syntax:      	    int32 mapi_terminate( uint32 d, uint32 err_code )
Remarks:			Функция отправки системного сообщения процессу ядра о аварийном завершении 
					всех процессов в случае возникновения критических ошибок.
Returns:
***************************************************************************************************/
int32 mapi_terminate( uint32 d, uint32 err_code )
{
  int32 res = 0;
  
  s_mapi_terminate m;
  m.cmd = MAPI_TERMINATE;
  m.err_code = err_code;
    
  res = msg_send( d, &m, sizeof(m) );
  sleep_m(10);
  return res;
}
// ---------------------------------------------------------------------------
