// -- DO NOT REMOVE ----------------------------------------------------------
// !: arch: all
// !: sarc: all
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// !: codepage: cp1251
// !: d: Модуль содержит описания кодов ошибок, внутренних управляющих
// !: d: команд, структур и прототипы функций, необходимые для работы
// !: d: драйвера часов реального времени DS1302.
// !: -: 
// ---------------------------------------------------------------------------
#ifndef __DS1302_H__
#define __DS1302_H__

#include <os_types.h>

//********************************************************
//  RTC Driver control command codes
//********************************************************
#define RTC_SET_TIME            0x10000   //  Записать новое время в формате UNIX.
#define RTC_GET_TIME            0x10001   //  Получить текущее время в формате UNIX.
#define RTC_SET_TIME_STRUCT     0x10002   //  Записать новое время в формате структуры.
#define RTC_GET_TIME_STRUCT     0x10003   //  Получить текущее время в формате структуры.


// ---------------------------------------------------------------------------
// !: sn: s_rtc_regs
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// !: sd: Структура представления времени.
// !: sc: uint16, sec
// !: cd: секунды
// !: sc: uint16, min
// !: cd: минуты
// !: sc: uint16, hour
// !: cd: часы
// !: sc: uint16, day
// !: cd: день месяца
// !: sc: uint16, month
// !: cd: месяц
// !: sc: uint16, year
// !: cd: год
// ---------------------------------------------------------------------------
struct s_rtc_regs {
  uint16  sec;
  uint16  min;
  uint16  hour;
  uint16  day;
  uint16  month;
  uint16  year;
};

extern int32   drv_rtc_plug( const char* path );
extern int32   drv_rtc_unplug( const char* name );


#endif
